<?php
$plug_cmds = array('расп');
$plug_smalldescription = 'Узнать расписание по которому учится Какер(приват команда!!11)';
$plug_mainfunc = function ($kb_msg){
		$text = $kb_msg[5];
		$answ = explode(' ',$text);
		if($answ[2]=='1'){
			apisay('Понедельник:<br><br>1)Нет пары/История(618)<br>-------------------------<br>2)Информатика(На 3 этаже)<br>-------------------------<br>3)Иностранный яз(714/515)/Нет пары',$kb_msg[3], $kb_msg[1]);
		}
		if($answ[2]=='2'){
			apisay('Вторник:<br><br>1)Нет пары<br>-------------------------<br>2)Иностранный яз(714/515)<br>-------------------------<br>3)Физ-ра(С/з)<br>-------------------------<br>4)Физика(601)/Нет пары',$kb_msg[3], $kb_msg[1]);
		}
		if($answ[2]=='3'){
			apisay('Среда:<br><br>1)История(618)<br>-------------------------<br>2)Математика(713)<br>-------------------------<br>3)Русский Язык(710)<br>-------------------------<br>4)Нет пары/Литература(710)',$kb_msg[3], $kb_msg[1]);
		}
		if($answ[2]=='4'){
			apisay('Четверг:<br><br>1)Физика(601)<br>-------------------------<br>2)Экология(608)<br>-------------------------<br>3)Химия(601)',$kb_msg[3], $kb_msg[1]);
		}
		if($answ[2]=='5'){
			apisay('Пятница:<br><br>1)Математика(713)/Обществознание(715)<br>-------------------------<br>2)ОБЖ(712[временно в 706])<br>-------------------------<br>3)Информатика(710)<br>-------------------------<br>4)Физ-ра(С/з)/Математика(713)',$kb_msg[3], $kb_msg[1]);
		}
		if($answ[2]=='6'){
			apisay('Суббота:<br><br>1)Обществознание(715)<br>-------------------------<br>2)Литература(710)<br>-------------------------<br>3)Математика(713)',$kb_msg[3], $kb_msg[1]);
		}
		if(empty($answ[2]))
			apisay('Вы забыли указать нужный параметр',$kb_msg[3], $kb_msg[1]);
		if($answ[2]=='7')
			apisay('Я тебе лично разрешаю в воскресенье учиться',$kb_msg[3], $kb_msg[1]);
		if($answ[2] > 7)
			apisay('Боюсь тебя огорчить, но в неделе всего 7 дней, и только 6 из них ты учишься',$kb_msg[3], $kb_msg[1]);
		if($answ[2] < 0)
			apisay('О, вы тоже из другой мировой линии?',$kb_msg[3], $kb_msg[1]);
};

register_command(array(
		'cmds' => $plug_cmds,
		'cmdfunc' => $plug_mainfunc,
		'smalldescription' => $plug_smalldescription
));
